In [61]:
import pandas as pd
df=pd.read_csv("income.csv")
d=d.copy()
df
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [78]:
df.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013', 'last three years avg'],
      dtype='object')

In [79]:
df["2010"]

0    40933
1    57848
2    46896
3    38587
4    54283
Name: 2010, dtype: int64

In [80]:
df[["2010"]]

    2010
0  40933
1  57848
2  46896
3  38587
4  54283

In [81]:
s=0
for i in df["2010"]:
    s=s+i
print(s)

238547

to find the sum of row

In [82]:
df.iloc[1,2:]

2005                      55891
2006                      56418
2007                      62993
2008                      63989
2009                      61604
2010                      57848
2011                      57431
2012                      63648
2013                      61137
last three years avg    62392.5
Name: 1, dtype: object

In [83]:
s=0
for i in df.iloc[1,2:]:
    s=s+i
print(s)

603351.5

In [84]:
df["2010"].sum()

238547

4th row and all column sum

In [85]:
df.iloc[4,2:]

2005                    51755
2006                    55319
2007                    55734
2008                    57014
2009                    56134
2010                    54283
2011                    53367
2012                    57020
2013                    57528
last three years avg    57274
Name: 4, dtype: object

In [86]:
s=0
for i in df.iloc[4,2:]:
    s=s+i
print(s)
# direct
df.iloc[4,2:].sum()

555428.0

555428.0

In [87]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years avg
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381,42422.5
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137,62392.5
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602,48823.0
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919,39468.5
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528,57274.0

In [88]:
df.iloc[0:,2:6].sum()

2005    226699
2006    233403
2007    264727
2008    251979
dtype: int64

In [89]:
a=df.iloc[:,2:6].sum()
a.sum()

976808

In [90]:
a=df.iloc[:,2:].sum()
a.sum()

2449802.5

To find the total sum of the individual columns

In [91]:
df.sum()

GEOID                   04000US0104000US0204000US0404000US0504000US06
State                          AlabamaAlaskaArizonaArkansasCalifornia
2005                                                           226699
2006                                                           233403
2007                                                           264727
2008                                                           251979
2009                                                           239995
2010                                                           238547
2011                                                           243311
2012                                                           250194
2013                                                           250567
last three years avg                                           250380
dtype: object

To find the total sum of individual rows

In [92]:
df.sum(1)

0    412560.5
1    603351.5
2    489534.0
3    388928.5
4    555428.0
dtype: float64

In [93]:
#prod() #---> to find product 
# to find the product 1 and 2 rows upto 2008 columns
f=df.iloc[0:1,2:6].prod()
f.prod()

2647007284500121600

###### mean()---- to find the average

In [94]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years avg
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381,42422.5
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137,62392.5
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602,48823.0
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919,39468.5
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528,57274.0

In [95]:
print(df["2011"].mean()) ## find the avg of 2011 column
print(df.iloc[2,2:].mean()) ## find the avg of second row

48662.2
48953.4

#### median()   --- to find middle value

In [96]:
#median()
print(df["2011"].median())
print(df.iloc[2,2:].median())

48621.0
46979.0

In [117]:
d=pd.read_csv("income.csv",index_col="State")
d

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528

### Task

1.Combined Average Income of all states from 2005 to 2013

In [118]:
a=d.iloc[0:,2:].mean()
a.mean()

49318.075

In [119]:
d.iloc[:,2:].mean()     # row wise average

2006    46680.6
2007    52945.4
2008    50395.8
2009    47999.0
2010    47709.4
2011    48662.2
2012    50038.8
2013    50113.4
dtype: float64

In [120]:
d.iloc[0:,2:].mean(1)  # column wise average

State
Alabama       41623.500
Alaska        60633.500
Arizona       49433.250
Arkansas      39100.250
California    55799.875
dtype: float64

2.State with highest average income in the last three years

In [121]:
d.iloc[:,-3:]   # values of last three years|

             2011   2012   2013
State
Alabama     42590  43464  41381
Alaska      57431  63648  61137
Arizona     48621  47044  50602
Arkansas    41302  39018  39919
California  53367  57020  57528

In [122]:
d.iloc[0:,-3:].mean(1)   # row wise avg of lst 3 yrs

State
Alabama       42478.333333
Alaska        60738.666667
Arizona       48755.666667
Arkansas      40079.666667
California    55971.666667
dtype: float64

In [123]:
d["last three years avg"]=d.iloc[0:,-3:].mean(1)
d

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years avg
State,,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381,42478.333333
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137,60738.666667
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602,48755.666667
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919,40079.666667
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528,55971.666667

In [124]:
d["last three years avg"]==max(d["last three years avg"])

State
Alabama       False
Alaska         True
Arizona       False
Arkansas      False
California    False
Name: last three years avg, dtype: bool

In [125]:
d[d["last three years avg"]==max(d["last three years avg"])].index[0]

'Alaska'

In [126]:
d.iloc[0:,-3:].mean(1).idxmax(1)

'Alaska'

3.State with lowest average income from 2007 to 2010(inclusive)

In [127]:
d.iloc[:,4:8]

             2008   2009   2010   2011
State
Alabama     44476  39980  40933  42590
Alaska      63989  61604  57848  57431
Arizona     46914  45739  46896  48621
Arkansas    39586  36538  38587  41302
California  57014  56134  54283  53367

In [128]:
d.iloc[:,4:8].mean(1)

State
Alabama       41994.75
Alaska        60218.00
Arizona       47042.50
Arkansas      39003.25
California    55199.50
dtype: float64

In [129]:
d.iloc[:,4:8].mean(1).idxmin()

'Arkansas'

In [130]:
a=d.iloc[:,2:].mean(1)
a

State
Alabama       41718.481481
Alaska        60645.185185
Arizona       49357.962963
Arkansas      39209.074074
California    55818.962963
dtype: float64

In [132]:
calavg=d.iloc[-1,2:].mean()
calavg

55818.96296296296

In [133]:
d.iloc[:,2:].mean(1)<calavg   calavg(california avg)

State
Alabama        True
Alaska        False
Arizona        True
Arkansas       True
California    False
dtype: bool

In [135]:
list(d[d.iloc[:,2:].mean(1)<calavg].index)

['Alabama', 'Arizona', 'Arkansas']

4.Print the names of states based on descending order of income in the year 2009

In [136]:
s=d.iloc[:,6]
s

State
Alabama       40933
Alaska        57848
Arizona       46896
Arkansas      38587
California    54283
Name: 2010, dtype: int64

In [137]:
g=s.sort_values(ascending=False)
g

State
Alaska        57848
California    54283
Arizona       46896
Alabama       40933
Arkansas      38587
Name: 2010, dtype: int64

In [138]:
list(g.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

5.State with the lowest recorded income from 2005 to 2013'''

In [139]:
d.iloc[:2,:].idxmin()

TypeError: reduction operation 'argmin' not allowed for this dtype